CSI API ETABS v1

# cDCoAS_3600_2018GetPreference Method

---

Retrieves the value of a concrete design preference item.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetPreference(
    	int Item,
    	ref double Value
    )

    Function GetPreference (
    	Item As Integer,
    	ByRef Value As Double
    ) As Integer

    Dim instance As cDCoAS_3600_2018
    Dim Item As Integer
    Dim Value As Double
    Dim returnValue As Integer

    returnValue = instance.GetPreference(Item,
    	Value)

    int GetPreference(
    	int Item,
    	double% Value
    )

    abstract GetPreference :
            Item : int *
            Value : float byref -> int

#### Parameters

Item

    Type: SystemInt32
This is an integer between 1 and 11, inclusive, indicating the preference item
considered.

  1. Number of interaction curves
  2. Number of interaction points
  3. Consider minimum eccentricity
  4. Phi tension controlled
  5. Phi compression controlled tied
  6. Phi shear and/or torsion
  7. Phi shear seismic
  8. Phi joint shear
  9. Pattern live load factor
  10. Utilization factor limit
  11. Multi-response case design

Value

    Type: SystemDouble
The value of the considered preference item.

  1. Number of interaction curves

Value >= 4 and divisable by 4

  2. Number of interaction points

Value >= 5 and odd

  3. Consider minimum eccentricity

0 = No

Any other value = Yes

  4. Phi tension controlled

Value > 0

  5. Phi compression controlled tied

Value > 0

  6. Phi shear and/or torsion

Value > 0

  7. Phi shear seismic

Value > 0

  8. Phi joint shear

Value > 0

  9. Pattern live load factor

Value >= 0

  10. Utilization factor limit

Value > 0

  11. Multi-response case design
     * 1 = Envelopes
     * 2 = Step-by step
     * 3 = Last step
     * 4 = Envelopes - All
     * 5 = Step-by step - All

#### Return Value

Type: Int32
Returns zero if the item is successfully retrieved; otherwise it returns a
nonzero value.

See Also

#### Reference

cDCoAS_3600_2018 Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com